In [2]:
%pylab
import pandas as pd

Using matplotlib backend: Qt5Agg
Populating the interactive namespace from numpy and matplotlib

**df=pd.DataFrame(diccionario)**

In [4]:
d1={"Adaya":(10,9,10),
   "Isui":(9,9,8),
   "Andrés":(10,10,10),
   "Rodrigo":(9,8,7),
   "Mariana":(9,9,9)}
print(d1)

{'Adaya': (10, 9, 10), 'Isui': (9, 9, 8), 'Andrés': (10, 10, 10), 'Rodrigo': (9, 8, 7), 'Mariana': (9, 9, 9)}

In [5]:
df1=pd.DataFrame(d1)
print(df1)

   Adaya  Isui  Andrés  Rodrigo  Mariana
0     10     9      10        9        9
1      9     9      10        8        9
2     10     8      10        7        9

In [6]:
df1.iloc[0,0] # fila columna

10

In [7]:
#forma1
df1.iloc[0,4] #fila columna

9

In [9]:
df1.loc[0,"Mariana"] #sin el índice le quito la i

9

In [10]:
#calif del tercer parcial de Rodrigo
df1.iloc[2,3]

7

In [11]:
#sin el índice
df1.loc[2,"Rodrigo"] #fila columna

7

In [16]:
# tres parciales de Andrés
df1.iloc[0:3,2:3] # renglón incluído: Renglón no incluído, cant inclida: cant no incluida

   Andrés
0      10
1      10
2      10

In [17]:
# tres parciales de Adaya
df1.iloc[0:3,0:1]

   Adaya
0     10
1      9
2     10

In [19]:
df1.iloc[0:3,3:5] # renglón incluído: Renglón no incluído, cant inclida: cant no incluida

   Rodrigo  Mariana
0        9        9
1        8        9
2        7        9

In [25]:
# las calificaciones del ex1 y ex3 de Adaya y Andrés
df1.iloc[[0,2],[0,2]]#solo índices de filas y columnas que necesito

   Adaya  Andrés
0     10      10
2     10      10

In [28]:
# las calificaciones del ex1, ex2, ex3 de Adaya y Andrés
df1.iloc[0:3,[0,2]]

   Adaya  Andrés
0     10      10
1      9      10
2     10      10

In [29]:
pwd

'C:\\Users\\Dell Inspiron\\Documents\\PADRON WORKS'

In [38]:
no="Andrés Adaya Isui Jesús Alberto Karla AnaPao Mariana Fernanda Sofía"
nom=no.split()
carrera="Actuaría CienciasD Economía Finanzas Derecho Ingeniería Física Química Matemáticas Administración"
carr=carrera.split()
ed=randint(18,22,10)
seme=randint(1,10,10)
alumnos={}
aux=range(0,10,1)
for i in aux:
    alumnos["nombre"]=nom[i]
    alumnos["carrera"]=carr[i]
    alumnos["edad"]=ed[i]
    alumnos["semestre"]=seme[i]
    print(alumnos)

{'nombre': 'Andrés', 'carrera': 'Actuaría', 'edad': 18, 'semestre': 6}
{'nombre': 'Adaya', 'carrera': 'CienciasD', 'edad': 20, 'semestre': 4}
{'nombre': 'Isui', 'carrera': 'Economía', 'edad': 20, 'semestre': 7}
{'nombre': 'Jesús', 'carrera': 'Finanzas', 'edad': 18, 'semestre': 4}
{'nombre': 'Alberto', 'carrera': 'Derecho', 'edad': 19, 'semestre': 5}
{'nombre': 'Karla', 'carrera': 'Ingeniería', 'edad': 21, 'semestre': 2}
{'nombre': 'AnaPao', 'carrera': 'Física', 'edad': 19, 'semestre': 6}
{'nombre': 'Mariana', 'carrera': 'Química', 'edad': 20, 'semestre': 9}
{'nombre': 'Fernanda', 'carrera': 'Matemáticas', 'edad': 21, 'semestre': 6}
{'nombre': 'Sofía', 'carrera': 'Administración', 'edad': 18, 'semestre': 5}

In [39]:
df2=pd.read_excel("datos.xlsx")
print(df2)

     Nombre        Carrera  Semestre  Edad
0      Isui  Administrador         9    18
1       Ian     Economista         1    23
2      Isui       Contador        10    19
3      Isui        Derecho         8    22
4     Alexa       Contador         4    18
..      ...            ...       ...   ...
94    Erick         Físico         5    18
95     Isui       Actuario         7    21
96    Alexa        Derecho         5    20
97     Taly       Actuario         4    19
98  Abraham     Ingeniería         7    21

[99 rows x 4 columns]

In [40]:
len(df2)

99

In [41]:
df2.head()

  Nombre        Carrera  Semestre  Edad
0   Isui  Administrador         9    18
1    Ian     Economista         1    23
2   Isui       Contador        10    19
3   Isui        Derecho         8    22
4  Alexa       Contador         4    18

In [42]:
df2.iloc[[0,50,90],[0,2]]

   Nombre  Semestre
0    Isui         9
50   Yoav        10
90   Yoav         8

In [52]:
df2.iloc[[0,69,91],[0,2]]

     Nombre  Semestre
0      Isui         9
69    Erick         1
91  Abraham         8

In [53]:
df2.max()

Nombre            Yoav
Carrera     Matemático
Semestre            10
Edad                23
dtype: object

In [54]:
df2.min()

Nombre      Abraham
Carrera     Abogado
Semestre          1
Edad             18
dtype: object